backend/app/controllers/pokemons_controller.rb

SELECT "pokemons".* FROM "pokemons"
---
    def index
        pokemons = Pokemon.all