backend/app/controllers/pokemon_trainers_controller.rb

    def index
        pokemonTrainers = PokemonTrainer.all
---
SELECT "pokemon_trainers".* FROM "pokemon_trainers"

    def show
        pokemonTrainer = PokemonTrainer.find(params[:id])
---
SELECT "pokemon_trainers".* FROM "pokemon_trainers" WHERE "pokemon_trainers"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "trainers".* FROM "trainers" WHERE "trainers"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]

    def create
        trainer = Trainer.find(pokemon_trainer_params[:trainer_id])
        if Pokemon.find_by(id: pokemon_trainer_params[:pokemon_id])
            pokemon = Pokemon.find_by(id: pokemon_trainer_params[:pokemon_id])
        else
            pokemon = Pokemon.create id: pokemon_trainer_params[:pokemon_id], name: pokemon_trainer_params[:name], pokeType: pokemon_trainer_params[:pokeType], image: pokemon_trainer_params[:image]
        end
        pokemonTrainer = PokemonTrainer.create trainer: trainer, pokemon: pokemon
---
SELECT "trainers".* FROM "trainers" WHERE "trainers"."id" = ? LIMIT ?  [["id", 64], ["LIMIT", 1]]
SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
INSERT INTO "pokemon_trainers" ("pokemon_id", "trainer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["pokemon_id", 5], ["trainer_id", 4], ["created_at", "2021-01-29 19:00:32.938470"], ["updated_at", "2021-01-29 19:00:32.938470"]]
INSERT INTO "pokemons" ("id", "name", "pokeType", "created_at", "updated_at", "image") VALUES (?, ?, ?, ?, ?, ?)
INSERT INTO "pokemon_trainers" ("pokemon_id", "trainer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["pokemon_id", 5], ["trainer_id", 4], ["created_at", "2021-01-29 19:00:26.588571"], ["updated_at", "2021-01-29 19:00:26.588571"]]

    def destroy
        pokemonTrainer = PokemonTrainer.find(params[:id])
        pokemonTrainer.destroy
---
SELECT "pokemon_trainers".* FROM "pokemon_trainers" WHERE "pokemon_trainers"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
DELETE FROM "pokemon_trainers" WHERE "pokemon_trainers"."id" = ?  [["id", 2]]