backend/app/controllers/trainers_controller.rb

SELECT "trainers".* FROM "trainers"
---
    def index
        trainers = Trainer.all

SELECT "trainers".* FROM "trainers" WHERE "trainers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        trainer = Trainer.find(params[:id])

INSERT INTO "trainers" ("name", "gender", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Kara"], ["gender", "girl"], ["created_at", "2021-01-27 22:03:51.124522"], ["updated_at", "2021-01-27 22:03:51.124522"]]
---
    def create
        trainer = Trainer.create trainer_params